/**********************************************************************
* Copyright (C) 2022-2023 天津白泽技术有限公司 
* 文件名: hlw8112.h
* 描述:  hlw8112电量芯片操作文件
**********************************************************************/
#ifndef HLW8112_H
#define HLW8112_H
//////////////////////////////////////////////////////
void HLW8112_Init(void);     //初始化电量采集芯片
void HLW8112_CapData(void);  //读取电量采集数据
void Electricparam_task(void *pvParameters);
// void HLW8112_ServiceFunc(void);
////////////////////////////////////////////////
#endif

